#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/maxfrise/maxfrise-infra/runs/run-3DQk9x7orCKjhK5e

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...
module.sample_s3_lambda.data.archive_file.source: Refreshing...
module.sample_api_gateway.data.archive_file.function_archive: Refreshing...
module.sample_api_gateway.data.archive_file.function_archive: Refresh complete after 0s [id=041c9899188570a312d7171465c917e45b766b84]
module.sample_s3_lambda.data.archive_file.source: Refresh complete after 0s [id=a8eb6da38c7e1d31adc2af363472a1d492c6220a]
module.sample_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.agencies_api_gateway.aws_api_gateway_rest_api.agencies_api: Refreshing state... [id=5b7w7wsn0h]
module.sample_s3_lambda.aws_s3_object.file_upload: Refreshing state... [id=sample_s3_lambda.zip]
module.dynamoDB_agencies_prod_table.aws_dynamodb_table.agencies_prod: Refreshing state... [id=agencies-prod-table]
module.sample_s3_lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_lambda_s3]
module.sample_api_gateway.aws_api_gateway_rest_api.api_gateway_rest_api: Refreshing state... [id=ips6gacda4]
module.sample_api_gateway.aws_s3_object.file_upload: Refreshing state... [id=tf-lambda-apigw-sample.zip]
module.s3_bucket.aws_s3_bucket.lambda_bucket: Refreshing state... [id=testing-submodules-resources]
module.dynamoDB_agencies_test_table.aws_dynamodb_table.agencies_test: Refreshing state... [id=agencies-test-table]
module.sample_dynamodb_table.aws_dynamodb_table.tf_example_table: Refreshing state... [id=tf-test-table]
module.sample_api_gateway.aws_iam_role.iam_for_lambda_apigw: Refreshing state... [id=iam_lambda_apigw]
module.sample_lambda.aws_lambda_function.hello-terraform: Refreshing state... [id=hello-terraform]
module.agencies_api_gateway.aws_api_gateway_resource.agency_resource: Refreshing state... [id=892zgo]
module.sample_api_gateway.aws_api_gateway_resource.api_gateway: Refreshing state... [id=ryx13w]
module.sample_api_gateway.aws_lambda_function.lamba_apigateway_example: Refreshing state... [id=tf-api-gateway]
module.sample_s3_lambda.aws_lambda_function.lamba_s3_example: Refreshing state... [id=lambdaS3Example]
module.agencies_api_gateway.aws_api_gateway_method.agency_resource_method: Refreshing state... [id=agm-5b7w7wsn0h-892zgo-POST]
module.sample_api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-ips6gacda4-ryx13w-GET]
module.sample_api_gateway.aws_lambda_permission.lambda: Refreshing state... [id=AllowAPIGatewayInvoke]
module.sample_api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-ips6gacda4-ryx13w-GET]
module.sample_api_gateway.aws_api_gateway_deployment.api_gateway_deployment: Refreshing state... [id=st19iv]
module.agencies_api_gateway.aws_api_gateway_method.agency_resource_method: Drift detected (update)
module.agencies_api_gateway.aws_api_gateway_rest_api.agencies_api: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.agencies_api_gateway.aws_api_gateway_deployment.prod_deployment will be created
  + resource "aws_api_gateway_deployment" "prod_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "5b7w7wsn0h"
      + variables     = {
          + "environment" = "prod"
        }
    }

  # module.agencies_api_gateway.aws_api_gateway_deployment.test_deployment will be created
  + resource "aws_api_gateway_deployment" "test_deployment" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "5b7w7wsn0h"
      + variables     = {
          + "environment" = "test"
        }
    }

  # module.agencies_api_gateway.aws_api_gateway_integration.agencies_lambda_integration will be created
  + resource "aws_api_gateway_integration" "agencies_lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "892zgo"
      + rest_api_id             = "5b7w7wsn0h"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.agencies_api_gateway.aws_api_gateway_stage.prod will be created
  + resource "aws_api_gateway_stage" "prod" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "5b7w7wsn0h"
      + stage_name    = "prod"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.agencies_api_gateway.aws_api_gateway_stage.test will be created
  + resource "aws_api_gateway_stage" "test" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "5b7w7wsn0h"
      + stage_name    = "test"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.agencies_api_gateway.aws_iam_role.iam_for_agencies_api_lambda will be created
  + resource "aws_iam_role" "iam_for_agencies_api_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_for_agencies_api_lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.agencies_api_gateway.aws_lambda_function.agencies will be created
  + resource "aws_lambda_function" "agencies" {
      + architectures                  = [
          + "arm64",
        ]
      + arn                            = (known after apply)
      + filename                       = "./modules/api/agencies-api/lambda/dist/index.zip"
      + function_name                  = "agencies"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs18.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "/ydRUWoPniUDxiO7HKTBhFucr7lTwb0T5viXa3TdDpw="
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)
    }

  # module.sample_api_gateway.aws_lambda_function.lamba_apigateway_example will be updated in-place
  ~ resource "aws_lambda_function" "lamba_apigateway_example" {
        id                             = "tf-api-gateway"
      ~ last_modified                  = "2023-06-24T05:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "MuixUm9ZYjLsPEuXnJD6vEGUuxxXN3aB91OUYPQBVBU=" -> "kEAx2ezOjpiwEpWHuuN9fML0xIfHTryy2ZVcUoQVnVs="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sample_api_gateway.aws_s3_object.file_upload will be updated in-place
  ~ resource "aws_s3_object" "file_upload" {
      ~ etag                   = "ec75312b1143e7f3263a96954ae3754b" -> "a8526464d17b953ea2af3886c1dd064a"
        id                     = "tf-lambda-apigw-sample.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.sample_s3_lambda.aws_lambda_function.lamba_s3_example will be updated in-place
  ~ resource "aws_lambda_function" "lamba_s3_example" {
        id                             = "lambdaS3Example"
      ~ last_modified                  = "2023-06-24T05:35:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "VUj6B7jsFV5wt2v0Yjg+dhi16Uf377eW2H6yavLwEkg=" -> "8FK6xRtAlXqoSPOU2LiMGxadnPYFgVVtKe9x68MtGzU="
        tags                           = {}
        # (22 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sample_s3_lambda.aws_s3_object.file_upload will be updated in-place
  ~ resource "aws_s3_object" "file_upload" {
      ~ etag                   = "a800f08012c0581f74f036aed5531cc9" -> "f32f16ac00498cb4dad15d59a02a1702"
        id                     = "sample_s3_lambda.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 7 to add, 4 to change, 0 to destroy.

```

</details>

*Pushed by: @inavac182, Action: `pull_request`*